kaini-industries/hotspot-arcade/esp32/hotspot-arcade-fw/hotspot-arcade-fw.ino
static void onWsEvent(
    AsyncWebSocket* srv,
    AsyncWebSocketClient* client,
    AwsEventType type,
    void* arg,
    uint8_t* data,
    size_t len) {
    (void)srv;
    if(type == WS_EVT_DISCONNECT) {
        ENGINE_LOCK();
        engine.onWsDisconnect(client->id(), millis());
        ENGINE_UNLOCK();
    } else if(type == WS_EVT_DATA) {
        AwsFrameInfo* info = (AwsFrameInfo*)arg;
        if(info->final && info->index == 0 && info->len == len && info->opcode == WS_TEXT &&
           len < WS_MSG_MAX) {
            char buf[WS_MSG_MAX];
            memcpy(buf, data, len);
            buf[len] = '\0';
            ENGINE_LOCK();
            engine.onInput(client->id(), buf, millis());
            ENGINE_UNLOCK();
        }
    }
}

// ---------------- AP lifecycle ----------------

// The AP's DHCP server is where a station's IP and MAC are seen together. Registered
// once in setup(), before any AP comes up, so no lease is missed (see peerDeviceKey).
static void onWiFiEvent(WiFiEvent_t event, WiFiEventInfo_t info) {
    if(event == ARDUINO_EVENT_WIFI_AP_STAIPASSIGNED)
#if ESP_ARDUINO_VERSION_MAJOR >= 3
        // esp-idf 5+ (Arduino core 3.x, e.g. the C5): the assign event carries the MAC.
        leaseNote(info.wifi_ap_staipassigned.ip.addr, info.wifi_ap_staipassigned.mac);
#else
        // esp-idf 4.x (Arduino core 2.0.x, the S2/WROOM): the staipassigned event has no
        // MAC field, so we can't record the lease here. peerDeviceKey() then resolves the
        // station from the lwIP ARP cache at hello() time, which by then holds its entry.
        (void)info;
#endif
    else if(event == ARDUINO_EVENT_WIFI_AP_STADISCONNECTED)
        leaseForget(info.wifi_ap_stadisconnected.mac);
}

static void startPortal() {
    leasesClear(); // a fresh session leases fresh addresses
    WiFi.mode(WIFI_AP);
    WiFi.softAPConfig(apIP, apIP, IPAddress(255, 255, 255, 0));
    WiFi.softAP(apName, nullptr, 1, 0, apMaxConn); // open AP, up to apMaxConn stations
    delay(100);
    uartStatus("ap_ok");

    dnsServer.start(53, "*", apIP);
    ws.onEvent(onWsEvent);
    server.addHandler(&ws);
    server.addHandler(new ArcadeHandler()).setFilter(ON_AP_FILTER);
    server.begin();
    portalRunning = true;

    String up = String("up ip=") + WiFi.softAPIP().toString();
    uartStatus(up.c_str());
}

static void stopPortal() {
    if(portalRunning) {
        ws.closeAll();
        server.end();
        dnsServer.stop();
        WiFi.softAPdisconnect(true);
        portalRunning = false;
    }
    leasesClear();
    // Admission memory is session-scoped. A player known to the old party must
    // present the next party's join code after a host stop/new-session cycle.
    ENGINE_LOCK();
    clearKnownIdentities();
    joinCode[0] = '\0';
    engine.reset();
    ENGINE_UNLOCK();
    uartStatus("stopped");
}

// ---------------- UART RX (framed) ----------------

enum RxState { RX_SYNC, RX_TYPE, RX_LEN0, RX_LEN1, RX_PAYLOAD, RX_CRC, RX_RAW };
static RxState rxState = RX_SYNC;
static uint8_t rxType = 0;
static uint16_t rxLen = 0, rxIdx = 0;
static uint8_t rxCrc = 0;
static uint8_t rxBuf[HA_MAX_PAYLOAD + 1];
// Target of the current serialized host content transaction. It survives a failed
// BEGIN/staging bank so the one terminal COMMIT result still carries the requested id.
static uint8_t contentRequestGame = 0xFF;

// FILE_BEGIN payload: flags(1) pathlen(1) path mimelen(1) mime total(4 LE)
static void handleFileBegin(const uint8_t* p, size_t len) {
    if(len < 3) return;
    size_t i = 0;
    uint8_t flags = p[i++];
    uint8_t pathlen = p[i++];
    if(i + pathlen + 1 > len) return;
    char path[HA_ASSET_PATH];
    size_t pl = pathlen < HA_ASSET_PATH - 1 ? pathlen : HA_ASSET_PATH - 1;
    memcpy(path, p + i, pl);
    path[pl] = '\0';
    i += pathlen;
    uint8_t mimelen = p[i++];
    if(i + mimelen + 4 > len) return;
    char mime[HA_ASSET_MIME];
    size_t ml = mimelen < HA_ASSET_MIME - 1 ? mimelen : HA_ASSET_MIME - 1;
    memcpy(mime, p + i, ml);
    mime[ml] = '\0';
    i += mimelen;
    uint32_t total = (uint32_t)p[i] | ((uint32_t)p[i + 1] << 8) | ((uint32_t)p[i + 2] << 16) |
                     ((uint32_t)p[i + 3] << 24);
    assets.begin(path, mime, flags & 1, total);
}

static void dispatchFrame() {
    rxBuf[rxLen] = '\0'; // JSON payloads are text; safe (buf has +1)
    switch(rxType) {
    case HA_MSG_CLEAR_FILES:
        assets.clear();
        uartStatus("cleared");
        break;
    case HA_MSG_FILE_BEGIN:
        handleFileBegin(rxBuf, rxLen);
        if(assets.receiving()) {
            rxState = RX_RAW; // the file bytes follow, unframed
            return;
        }
        uartStatus("fok"); // zero-length file committed immediately
        break;
    case HA_MSG_SET_AP:
        if(rxLen > 0) {
            size_t n = rxLen < sizeof(apName) - 1 ? rxLen : sizeof(apName) - 1;
            memcpy(apName, rxBuf, n);
            apName[n] = '\0';
        }
        assets.finishStream(); // file phase done: persist the bundle + its CRC if it changed
        uartStatus("ap_set");
        break;
    case HA_MSG_START:
        startPortal();
        break;
    case HA_MSG_STOP:
        stopPortal();
        break;
    case HA_MSG_RESET:
        uartStatus("resetting");
        delay(50);
        ESP.restart();
        break;
    case HA_MSG_SELECT_GAME:
        // v21 selection is inseparable from its content transaction. Silently
        // selecting here could expose a zero-pack lobby, so old hosts get an
        // explicit failure and leave the live game untouched.
        uartStatus("select_deprecated");
        break;
    case HA_MSG_CONTENT_BEGIN: {
        bool ok = false;
        uint8_t target = rxLen ? rxBuf[0] : 0xFF;
        contentRequestGame = target;
        if(rxLen >= 1 && rxLen <= 8) {
            char lang[8];
            size_t n = rxLen - 1;
            memcpy(lang, rxBuf + 1, n);
            lang[n] = '\0';
            ENGINE_LOCK();
            ok = engine.contentBegin(rxBuf[0], lang);
            ENGINE_UNLOCK();
        } else {
            // Any BEGIN frame supersedes staging. A malformed one must not leave
            // an older transaction available to an unrelated later COMMIT.
            ENGINE_LOCK();
            engine.contentAbort();
            ENGINE_UNLOCK();
        }
        // BEGIN/PACK/ITEM diagnostics are deliberately nonterminal. Only COMMIT
        // emits content_ok/content_error, so a delayed intermediate failure cannot
        // cancel a later same-game retry on the host.
        uartContentStatus(ok ? "content_begin" : "content_invalid", target);
        break;
    }
    case HA_MSG_CONTENT_PACK:
        // payload: game byte, then the pack name (not NUL-terminated on the wire).
        if(rxLen >= 2 && rxLen <= 64) {
            char name[64];
            size_t n = rxLen - 1;
            memcpy(name, rxBuf + 1, n);
            name[n] = '\0';
            bool ok;
            ENGINE_LOCK();
            ok = engine.contentPack(rxBuf[0], name);
            ENGINE_UNLOCK();
            if(!ok) uartContentStatus("content_invalid", contentRequestGame);
        } else {
            // Poison an existing stage as well as reporting the malformed frame;
            // truncating an overlong name could otherwise commit different content
            // than the host counted and displayed.
            ENGINE_LOCK();
            engine.contentPack(rxLen ? rxBuf[0] : 0, "");
            ENGINE_UNLOCK();
            uartContentStatus("content_invalid", contentRequestGame);
        }
        break;
    case HA_MSG_CONTENT_ITEM: {
        bool ok;
        ENGINE_LOCK();
        ok = engine.contentItem((const char*)rxBuf);
        ENGINE_UNLOCK();
        if(!ok) uartContentStatus("content_invalid", contentRequestGame);
        break;
    }
    case HA_MSG_CONTENT_COMMIT: {
        bool ok = false;
        uint8_t target = contentRequestGame;
        if(rxLen == 4) {
            uint16_t packs = (uint16_t)rxBuf[0] | ((uint16_t)rxBuf[1] << 8);
            uint16_t items = (uint16_t)rxBuf[2] | ((uint16_t)rxBuf[3] << 8);
            ENGINE_LOCK();
            ok = engine.contentCommit(packs, items);
            ENGINE_UNLOCK();
        } else {
            // A malformed commit terminates the transaction; retaining its stage
            // could let an unrelated later COMMIT publish stale content.
            ENGINE_LOCK();
            engine.contentAbort();
            ENGINE_UNLOCK();
        }
        if(ok) {
            // Include the committed id so delayed/back-to-back host requests cannot
            // misassociate an acknowledgement with a newer pending selection.
            uartContentStatus("content_ok", target);
        } else {
            uartContentStatus("content_error", target);
        }
        contentRequestGame = 0xFF;
        break;
    }
    case HA_MSG_CONTENT_ABORT:
        ENGINE_LOCK();
        engine.contentAbort();
        ENGINE_UNLOCK();
        contentRequestGame = 0xFF;
        uartStatus("content_abort");
        break;
    case HA_MSG_ROUND_END:
        ENGINE_LOCK();
        engine.roundEnd();
        ENGINE_UNLOCK();
        break;
    case HA_MSG_CONFIG: {
        const char* configJson = (const char*)rxBuf;
        if(!ha_json_flat_object_valid(configJson)) {
            uartStatus("config_error");
            break;
        }
        const char* codeValue = ha_json_find(configJson, "code");
        char code[7];
        if(codeValue && !haParseJoinCodeExact(configJson, code)) {
            uartStatus("config_error");
            break;
        }
        int v;
        if(ha_json_int(configJson, "max", &v) && v >= 1 && v <= HA_MAX_PLAYERS)
            apMaxConn = (uint8_t)v;
        // The async WebSocket path reads admission state only while holding the
        // engine mutex. Update admission state in that same synchronization
        // domain so a hello cannot race a partial CONFIG transition. Locale is
        // committed transactionally with the selected content bank and CONFIG
        // cannot change it ahead of a content commit that may fail.
        ENGINE_LOCK();
        if(codeValue) strlcpy(joinCode, code, sizeof(joinCode));
        ENGINE_UNLOCK();
        break;
    }
    case HA_MSG_RESET_SCORES:
        ENGINE_LOCK();
        engine.resetScores();
        ENGINE_UNLOCK();
        break;
    default:
        break;
    }
    rxState = RX_SYNC;
}

